Repository: patricktran2911/iUSC
Catalog: ESDataLayer/LocalizationHelper/Resources/DataModelLocalizable.xcstrings
Source language: en
Languages: vi

source: (Persian) Gulf War
vi: (Ba Tư) Chiến tranh vùng Vịnh

source: A change (to the Constitution)
vi: Một sự thay đổi (theo Hiến pháp)

source: A court ruling
vi: Một phán quyết của tòa án

source: A male citizen of any race (can vote).
vi: Một công dân nam của bất kỳ chủng tộc (có thể bỏ phiếu).

source: A removal of a law
vi: Loại bỏ một luật

source: Advises the President
vi: Tư vấn cho tổng thống

source: Africans
vi: Người châu Phi

source: All people of the state
vi: Tất cả mọi người của tiểu bang

source: America the Beautiful
vi: Nước Mỹ xinh đẹp

source: American Samoa
vi: Samoa Mỹ

source: An addition (to the Constitution)
vi: Một bổ sung (cho Hiến pháp)

source: Announced our independence (from Great Britain)
vi: Tuyên bố độc lập của chúng tôi (từ Vương quốc Anh)

source: Answers will vary
vi: Câu trả lời sẽ thay đổi

source: Any age with parental consent
vi: Mọi lứa tuổi với sự đồng ý của cha mẹ

source: Any citizen can vote. (Women and men can vote)
vi: Bất kỳ công dân nào cũng có thể bỏ phiếu. (Phụ nữ và nam giới có thể bỏ phiếu)

source: Appoints federal judges
vi: Chỉ định các thẩm phán liên bang

source: Approve zoning and land use
vi: Phê duyệt phân vùng và sử dụng đất

source: Approves laws
vi: Chấp thuận luật

source: April 15
vi: Ngày 15 tháng 4

source: Arctic Ocean
vi: Bắc Băng Dương

source: Assembly
vi: Cuộc họp

source: At age eighteen (18)
vi: Ở tuổi mười tám (18)

source: Atlantic Ocean
vi: Đại Tây Dương

source: Attorney General
vi: Tổng chưởng lý

source: Be loyal to the United States
vi: Trung thành với Hoa Kỳ

source: because each star represents a state
vi: bởi vì mỗi ngôi sao đại diện cho một trạng thái

source: because of 13 founding fathers
vi: Vì 13 người sáng lập

source: Because of high taxes (taxation without representation)
vi: Do thuế cao (thuế không có đại diện)

source: because of the 50 founding fathers
vi: Vì 50 người sáng lập

source: Because of the state population
vi: Vì dân số nhà nước

source: Because some states have more people
vi: Bởi vì một số tiểu bang có nhiều người hơn

source: Because the British army stayed in their houses (boarding, quartering)
vi: Bởi vì quân đội Anh ở trong nhà của họ (nội trú, quý)

source: because the stripes represent the original colonies
vi: bởi vì các sọc đại diện cho các thuộc địa ban đầu

source: because there are 50 states
vi: Vì có 50 tiểu bang

source: because there is one star for each state
vi: bởi vì có một ngôi sao cho mỗi tiểu bang

source: because there were 13 amendments
vi: Vì có 13 sửa đổi

source: because there were 13 original colonies
vi: Vì có 13 thuộc địa ban đầu

source: Because they are larger in size
vi: Bởi vì chúng có kích thước lớn hơn

source: Because they didnt have self-government
vi: Bởi vì họ không có chính phủ tự

source: Because they disliked tea
vi: Bởi vì họ không thích trà

source: Because they have more people
vi: Bởi vì họ có nhiều người hơn

source: "Before he was President, Eisenhower was a general. What war was he in?"
vi: "Trước khi làm Tổng thống, Eisenhower là tướng. Ông tham gia cuộc chiến nào?"

source: Before turning 16
vi: Trước khi bước sang tuổi 16

source: Between eighteen (18) and twenty-six (26)
vi: Từ mười tám (18) đến hai mươi sáu (26)

source: British settlers
vi: Người định cư Anh

source: Call Senators and Representatives
vi: Gọi cho các thượng nghị sĩ và đại diện

source: Capitalist economy
vi: Kinh tế tư bản

source: Checks and balances
vi: Kiểm tra và cân bằng

source: Chief Justice
vi: Chánh án

source: chiefJustice
vi: Trưởng phòng

source: Christmas
vi: Giáng sinh

source: Citizens eighteen (18) and older can vote
vi: Công dân mười tám (18) và người già có thể bỏ phiếu

source: Civil rights (movement)
vi: Dân quyền (Phong trào)

source: Civil War
vi: Nội chiến

source: Colorado River
vi: Sông Colorado

source: Columbus Day
vi: Ngày Columbus

source: Commands the military
vi: Chỉ huy quân đội

source: Communism
vi: Chủ nghĩa cộng sản

source: Congress
vi: Quốc hội

source: Creek
vi: Lạch

source: December
vi: Tháng 12

source: December 31
vi: Ngày 31 tháng 12

source: Decides if a law goes against the Constitution
vi: Quyết định xem một đạo luật có đi ngược lại Hiến pháp không

source: Declared our independence (from Great Britain)
vi: Tuyên bố sự độc lập của chúng tôi (từ Vương quốc Anh)

source: Declared war on Britain
vi: Tuyên chiến với nước Anh

source: Declares independence from Great Britain
vi: Tuyên bố độc lập từ Vương quốc Anh

source: Defend the Constitution and laws of the United States
vi: Bảo vệ Hiến pháp và luật pháp của Hoa Kỳ

source: Defines the government
vi: Xác định chính phủ

source: Delaware
vi: Del biết

source: Democratic
vi: Dân chủ

source: Democratic and Republican
vi: Dân chủ và Cộng hòa

source: "During the Cold War, what was the main concern of the United States?"
vi: "Trong Chiến tranh Lạnh, mối quan ngại chính của Hoa Kỳ là gì?"

source: Easter
vi: Lễ Phục sinh

source: Economic opportunity
vi: Cơ hội kinh tế

source: economic reasons
vi: lý do kinh tế

source: eight (8)
vi: Tám (8)

source: Eight (8)
vi: Tám (8)

source: Eighteen (18) and older
vi: Mười tám (18) và cũ hơn

source: Ellis Island
vi: Đảo Ellis

source: Ended the Civil War
vi: Kết thúc cuộc nội chiến

source: Enforces laws
vi: Thực thi luật pháp

source: Escape persecution
vi: Thoát khỏi cuộc đàn áp

source: Established the U.S. Constitution
vi: Thành lập Hiến pháp Hoa Kỳ

source: Europeans
vi: Người châu Âu

source: Everyone must follow the law
vi: Mọi người phải tuân theo luật pháp

source: Executive
vi: Điều hành

source: Executive orders
vi: Đơn đặt hàng điều hành

source: Explains laws
vi: Giải thích luật

source: Federal Reserve
vi: Cục Dự trữ Liên bang

source: Federalist and Whig
vi: Liên bang và Whig

source: Fifty (50)
vi: Năm mươi (50)

source: First Postmaster General of the United States
vi: Tướng bưu điện đầu tiên của Hoa Kỳ

source: fought for civil rights
vi: chiến đấu vì quyền công dân

source: Fought for civil rights
vi: Chiến đấu vì quyền công dân

source: fought for women rights
vi: chiến đấu vì quyền phụ nữ

source: four (4)
vi: Bốn (4)

source: Four (4)
vi: Bốn (4)

source: Four hundred thirty-five (435)
vi: Bốn trăm ba mươi lăm (435)

source: France, Germany, and Britain
vi: Pháp, Đức và Anh

source: free college education
vi: Giáo dục đại học miễn phí

source: Freed slaves in the Confederate states
vi: Nô lệ được giải phóng ở các quốc gia Liên minh

source: Freed the slaves (Emancipation Proclamation)
vi: Giải phóng nô lệ (Tuyên bố giải phóng)

source: Freedom
vi: Tự do

source: Freedom from taxation
vi: Tự do khỏi thuế

source: freedom of assembly
vi: Tự do lắp ráp

source: freedom of expression
vi: Tự do ngôn luận

source: freedom of religion
vi: Tự do tôn giáo

source: Freedom of religion
vi: Tự do tôn giáo

source: Freedom of religion applies only in churches.
vi: Tự do tôn giáo chỉ áp dụng trong các nhà thờ.

source: freedom of speech
vi: Tự do ngôn luận

source: Freedom of speech
vi: Tự do ngôn luận

source: freedom to petition the government
vi: Tự do kiến ​​nghị chính phủ

source: Gave women the right to vote
vi: Đã cho phụ nữ quyền bầu cử

source: geography
vi: địa lý

source: Give a driver license
vi: Cấp giấy phép lái xe

source: Give an elected official your opinion on an issue
vi: Đưa ra một quan chức được bầu theo ý kiến ​​của bạn về một vấn đề

source: Give up loyalty to other countries
vi: Từ bỏ lòng trung thành với các quốc gia khác

source: God Bless America
vi: Chúa phù hộ cho nước Mỹ

source: government
vi: chính phủ

source: Government must obey the law
vi: Chính phủ phải tuân thủ luật pháp

source: governor
vi: Thống đốc

source: Green and Libertarian
vi: Xanh và tự do

source: Green movement
vi: Chuyển động xanh

source: Help with a campaign
vi: Giúp đỡ với một chiến dịch

source: history-1800
vi: Lịch sử-1800

source: history-colonial
vi: Lịch sử thuộc địa

source: history-geo
vi: lịch sử-geo

source: history-modern
vi: Lịch sử hiện đại

source: "How many amendments does the Constitution have?"
vi: "Hiến pháp có bao nhiêu tu chính án?"

source: "How many justices are on the Supreme Court?"
vi: "Có bao nhiêu Thẩm phán tại Tòa án Tối cao?"

source: "How many U.S. Senators are there?"
vi: "Có bao nhiêu Thượng nghị sĩ Hoa Kỳ?"

source: "How old do citizens have to be to vote for President?"
vi: "Công dân phải bao nhiêu tuổi mới được bầu Tổng thống?"

source: "If both the President and the Vice President can no longer serve, who becomes President?"
vi: "Nếu cả Tổng thống và Phó Tổng thống không còn phục vụ được, ai sẽ trở thành Tổng thống?"

source: "If the President can no longer serve, who becomes President?"
vi: "Nếu Tổng thống không còn phục vụ được nữa, ai sẽ trở thành Tổng thống?"

source: Immigration
vi: Nhập cư

source: In God We Trust
vi: Trong Chúa chúng tôi tin tưởng

source: "In what month do we vote for President?"
vi: "Chúng ta bỏ phiếu bầu Tổng thống vào tháng nào?"

source: Independence Day
vi: Ngày quốc khánh

source: Independent
vi: Độc lập

source: Indian Ocean
vi: Ấn Độ Dương

source: interchangeAnswer
vi: người thay thế

source: January
vi: Tháng Một

source: Japan, Germany, and Italy
vi: Nhật Bản, Đức và Ý

source: Japan, Korea, and Vietnam
vi: Nhật Bản, Hàn Quốc và Việt Nam

source: Join a civic group
vi: Tham gia một nhóm dân sự

source: Join a community group
vi: Tham gia một nhóm cộng đồng

source: Join a political party
vi: Tham gia một đảng chính trị

source: Join the military to vote
vi: Tham gia quân đội để bỏ phiếu

source: Judicial
vi: Tư pháp

source: Judicial review
vi: Đánh giá tư pháp

source: July 1
vi: Ngày 1 tháng 7

source: July 2, 1776
vi: Ngày 2 tháng 7 năm 1776

source: July 4
vi: Ngày 4 tháng 7

source: July 4, 1776
vi: Ngày 4 tháng 7 năm 1776

source: June 4, 1776
vi: Ngày 4 tháng 6 năm 1776

source: June 14
vi: Ngày 14 tháng 6

source: Korean War
vi: Chiến tranh Triều Tiên

source: Labor and Conservative
vi: Lao động và bảo thủ

source: Labor Day
vi: Ngày lao động

source: Labor movement
vi: Phong trào lao động

source: Leaders must obey the law
vi: Các nhà lãnh đạo phải tuân thủ luật pháp

source: led the Civil War
vi: dẫn đầu cuộc nội chiến

source: Led the United States during the Civil War
vi: Lãnh đạo Hoa Kỳ trong cuộc nội chiến

source: Legislative
vi: Lập pháp

source: Libertarian
vi: Tự do

source: Liberty
vi: Tự do

source: Liberty Island
vi: Đảo Tự do

source: Life
vi: Mạng sống

source: Life, Liberty, Happiness
vi: Cuộc sống, tự do, hạnh phúc

source: Majority Leader
vi: Lãnh đạo đa số

source: March 1
vi: Ngày 1 tháng 3

source: Market economy
vi: Kinh tế thị trường

source: Martin Luther King, Jr. Day
vi: Martin Luther King, Ngày Jr.

source: May 1
vi: Ngày 1 tháng 5

source: Memorial Day
vi: Ngày tưởng niệm

source: Mexican-American War
vi: Chiến tranh người Mỹ gốc Mexico

source: Mississippi River
vi: Sông Mississippi

source: Missouri River
vi: Sông Missouri

source: multipleAnswer
vi: nhiều người

source: My Country, 'Tis of Thee
vi: Đất nước của tôi, 'Tis of Thee

source: "Name one American Indian tribe in the United States."
vi: "Hãy nêu tên một bộ lạc người Mỹ bản địa ở Hoa Kỳ."

source: "Name one branch or part of the government."
vi: "Kể tên một nhánh hoặc phần của chính phủ."

source: "Name one of the two longest rivers in the United States"
vi: "Kể tên một trong hai con sông dài nhất Hoa Kỳ."

source: "Name one problem that led to the Civil War"
vi: "Một vấn đề dẫn đến Nội chiến là gì?"

source: "Name one right only for United States citizens"
vi: "Kể tên một quyền chỉ dành cho công dân Hoa Kỳ."

source: "Name one state that borders Canada."
vi: "Hãy nêu tên một tiểu bang giáp Canada."

source: "Name one state that borders Mexico."
vi: "Hãy nêu tên một tiểu bang giáp Mexico."

source: "Name one U.S. territory."
vi: "Hãy nêu tên một lãnh thổ của Hoa Kỳ."

source: "Name one war fought by the United States in the 1800s"
vi: "Kể tên một cuộc chiến Hoa Kỳ tham gia vào những năm 1800."

source: "Name one war fought by the United States in the 1900s."
vi: "Kể tên một cuộc chiến Hoa Kỳ tham gia vào những năm 1900."

source: "Name the U.S. war between the North and the South."
vi: "Tên cuộc chiến giữa miền Bắc và miền Nam Hoa Kỳ là gì?"

source: "Name two national U.S. holidays."
vi: "Hãy nêu tên hai ngày lễ quốc gia của Hoa Kỳ."

source: "Name your U.S. Representative"
vi: "Hãy cho biết tên Dân biểu Hoa Kỳ của bạn."

source: Native Americans
vi: Người Mỹ bản địa

source: New Year Day
vi: Ngày đầu năm mới

source: New York City
vi: Thành phố New York

source: Nine (9)
vi: Chín (9)

source: No one is above the law
vi: Không ai ở trên luật pháp

source: North Carolina
vi: Bắc Carolina

source: North Dakota
vi: Bắc Dakota

source: Northern Mariana Islands
vi: Quần đảo Bắc Mariana

source: November
vi: Tháng mười một

source: Nuclear power plants
vi: Nhà máy điện hạt nhân

source: Obey the law
vi: Tuân theo luật pháp

source: Obey the laws of the United States
vi: Tuân theo luật pháp của Hoa Kỳ

source: October
vi: Tháng Mười

source: Oldest member of the Constitutional Convention
vi: Thành viên lâu đời nhất của Công ước Hiến pháp

source: One (1)
vi: Một (1)

source: One hundred (100)
vi: Một trăm (100)

source: Only if joining the military
vi: Chỉ khi gia nhập quân đội

source: Only major religions are recognized.
vi: Chỉ có các tôn giáo lớn được công nhận.

source: Only people who voted for them
vi: Chỉ những người đã bỏ phiếu cho họ

source: Only property owners can vote
vi: Chỉ chủ sở hữu tài sản mới có thể bỏ phiếu

source: Only state lawmakers
vi: Chỉ có các nhà lập pháp tiểu bang

source: Only taxpayers can vote
vi: Chỉ người nộp thuế mới có thể bỏ phiếu

source: Only the people in their political party
vi: Chỉ những người trong đảng chính trị của họ

source: Pacific Ocean
vi: Thái Bình Dương

source: Pay extra taxes
vi: Trả thêm thuế

source: Pay no taxes
vi: Không trả thuế

source: Pay taxes
vi: Trả thuế

source: People from Africa
vi: Người từ châu Phi

source: Petition the government
vi: Đơn thỉnh cầu chính phủ

source: Pilgrims
vi: Người hành hương

source: Planned economy
vi: Kinh tế có kế hoạch

source: Political liberty
vi: Tự do chính trị

source: Practice their religion
vi: Thực hành tôn giáo của họ

source: president
vi: chủ tịch

source: President
vi: Chủ tịch

source: Presidents Day
vi: Ngày tổng thống

source: Press
vi: Nhấn

source: principles
vi: nguyên tắc

source: Print money
vi: In tiền

source: Protects basic rights of Americans
vi: Bảo vệ các quyền cơ bản của người Mỹ

source: Provide protection (police)
vi: Cung cấp bảo vệ (cảnh sát)

source: Provide safety (fire departments)
vi: Cung cấp an toàn (sở cứu hỏa)

source: Provide schooling and education
vi: Cung cấp việc học và giáo dục

source: Publicly support or oppose an issue or policy
vi: Hỗ trợ công khai hoặc phản đối một vấn đề hoặc chính sách

source: Pursuit of happiness
vi: Theo đuổi hạnh phúc

source: Religion
vi: Tôn giáo

source: Religious freedom
vi: Tự do tôn giáo

source: representative
vi: tiêu biểu

source: Republican
vi: Đảng Cộng hòa

source: Resolves disputes (disagreements)
vi: Giải quyết tranh chấp (bất đồng)

source: Reviews laws
vi: Đánh giá luật

source: Revolutionary War
vi: Chiến tranh cách mạng

source: Rhode Island
vi: Đảo Rhode

source: Right to bear arms
vi: Quyền mang vũ khí

source: rights
vi: quyền

source: Run for federal office
vi: Chạy cho Văn phòng Liên bang

source: Run for office
vi: Chạy cho văn phòng

source: Russia, China, and Germany
vi: Nga, Trung Quốc và Đức

source: Said that the United States is free (from Great Britain)
vi: Nói rằng Hoa Kỳ là miễn phí (từ Vương quốc Anh)

source: Saved (or preserved) the Union
vi: Được lưu (hoặc bảo tồn) liên minh

source: Secretary of Agriculture
vi: Bộ trưởng Nông nghiệp

source: Secretary of Commerce
vi: Thư ký Thương mại

source: Secretary of Defense
vi: Bộ trưởng Quốc phòng

source: Secretary of Education
vi: Bộ trưởng Giáo dục

source: Secretary of Energy
vi: Thư ký năng lượng

source: Secretary of Health and Human Services
vi: Bộ trưởng Y tế và Dịch vụ Nhân sinh

source: Secretary of Homeland Security
vi: Bộ trưởng An ninh Nội địa

source: Secretary of Housing and Urban Development
vi: Thư ký Nhà ở và Phát triển Đô thị

source: Secretary of Labor
vi: Thư ký lao động

source: Secretary of State
vi: Ngoại trưởng

source: Secretary of the Interior
vi: Thư ký Nội vụ

source: Secretary of the Treasury
vi: Thư ký Kho bạc

source: Secretary of Transportation
vi: Bộ trưởng Giao thông vận tải

source: Secretary of Veterans Affairs
vi: Bộ trưởng Cựu chiến binh

source: Seminole
vi: Hội thảo

source: senator
vi: Thượng nghị sĩ

source: Separation of powers
vi: Tách quyền lực

source: September 17
vi: 17 tháng 9

source: September 17, 1787
vi: Ngày 17 tháng 9 năm 1787

source: Serve (do important work for) the nation (if needed)
vi: Phục vụ (làm công việc quan trọng cho) quốc gia (nếu cần)

source: Serve in the U.S. military (if needed)
vi: Phục vụ trong quân đội Hoa Kỳ (nếu cần)

source: Serve on a jury
vi: Phục vụ trong bồi thẩm đoàn

source: Sets up the government
vi: Thiết lập chính phủ

source: Seven (7)
vi: Bảy (7)

source: Signer of the Emancipation Proclamation
vi: Người ký tuyên bố giải phóng

source: singleAnswer
vi: Singleans

source: six (6)
vi: sáu (6)

source: Six (6)
vi: Sáu (6)

source: Sixteen (16) and older
vi: Mười sáu (16) trở lên

source: slavery
vi: nô lệ

source: Socialist economy
vi: Kinh tế xã hội chủ nghĩa

source: South Carolina
vi: Nam Carolina

source: Southern Ocean
vi: Nam Đại Dương

source: Spanish-American War
vi: Chiến tranh người Mỹ gốc Tây Ban Nha

source: speaker
vi: loa

source: Speaker of the House
vi: Chủ tịch ngôi nhà

source: Speech
vi: Lời nói

source: Started the first free libraries
vi: Bắt đầu các thư viện miễn phí đầu tiên

source: State governments
vi: Chính phủ tiểu bang

source: states rights
vi: quyền của nhà nước

source: symbols
vi: biểu tượng

source: systems
vi: hệ thống

source: taxation without representation
vi: Thuế mà không đại diện

source: Ten (10)
vi: Mười (10)

source: Terrorism
vi: Khủng bố

source: Terrorists attacked the United States.
vi: Những kẻ khủng bố đã tấn công Hoa Kỳ.

source: Thanksgiving
vi: Lễ tạ ơn

source: The Articles of Confederation
vi: Các bài viết của Liên minh

source: The Bill of Rights
vi: Dự luật về quyền

source: The Bill of Rights was debated
vi: Dự luật về quyền đã được tranh luận

source: The Cabinet and Congress
vi: Nội các và Quốc hội

source: The Chairman of the Joint Chiefs
vi: Chủ tịch của các thủ lĩnh chung

source: The Chief Justice
vi: Chánh án

source: The Civil Rights Act was passed.
vi: Đạo luật Dân quyền đã được thông qua.

source: The Civil War
vi: Nội chiến

source: The Congress
vi: Đại hội

source: The Constitution
vi: Hiến pháp

source: The Constitution was written
vi: Hiến pháp đã được viết

source: The Constitutional Court
vi: Tòa án Hiến pháp

source: The courts
vi: Các tòa án

source: The Declaration of Independence
vi: Tuyên ngôn độc lập

source: The Declaration of Independence was signed
vi: Tuyên bố độc lập đã được ký kết

source: The District Court
vi: Tòa án quận

source: The Emancipation Proclamation
vi: Tuyên bố giải phóng

source: The Federal Court of Appeals
vi: Tòa phúc thẩm liên bang

source: The Federalist Papers
vi: Các giấy tờ liên bang

source: "The Federalist Papers supported the passage of the U.S. Constitution. Name one of the writers"
vi: "Các bài viết Federalist ủng hộ việc thông qua Hiến pháp. Hãy nêu tên một tác giả."

source: The flag
vi: Cờ

source: The Founding Fathers wrote the Constitution
vi: Những người sáng lập đã viết Hiến pháp

source: "The House of Representatives has how many voting members?"
vi: "Hạ viện có bao nhiêu thành viên có quyền bỏ phiếu?"

source: "The idea of self-government is in the first three words of the Constitution. What are these words?"
vi: "Ý tưởng về tự trị nằm trong ba từ đầu tiên của Hiến pháp. Ba từ đó là gì?"

source: The Judicial and Executive branches
vi: Các nhánh tư pháp và hành pháp

source: The Korean War
vi: Chiến tranh Triều Tiên

source: The Louisiana Territory
vi: Lãnh thổ Louisiana

source: The military
vi: Quân đội

source: The President
vi: Tổng thống

source: The President and Vice President
vi: Chủ tịch và Phó chủ tịch

source: The president decides the law
vi: Tổng thống quyết định luật pháp

source: The President Pro Tempore of the Senate
vi: Tổng thống Pro Tempore của Thượng viện

source: The Revolutionary War
vi: Chiến tranh cách mạng

source: the right to bear arms
vi: Quyền mang vũ khí

source: The Secretary of Defense
vi: Bộ trưởng Quốc phòng

source: The Secretary of State
vi: Bộ trưởng Ngoại giao

source: The Senate and House (of Representatives)
vi: Thượng viện và Hạ viện (của đại diện)

source: The Senate and the House (of Representatives)
vi: Thượng viện và Hạ viện (của đại diện)

source: The Senate Majority Leader
vi: Lãnh đạo đa số Thượng viện

source: The Speaker of the House
vi: Người nói của ngôi nhà

source: The Star-Spangled Banner
vi: Biểu ngữ Star-Spangled

source: The stock market crashed.
vi: Thị trường chứng khoán sụp đổ.

source: The Supreme Court
vi: Tòa án tối cao

source: The U.S. (national) legislature
vi: Cơ quan lập pháp Hoa Kỳ (Quốc gia)

source: The U.S. declared war on Iraq.
vi: Hoa Kỳ tuyên chiến với Iraq.

source: The United States
vi: Hoa Kỳ

source: The Vice President
vi: Phó chủ tịch

source: The Vietnam War
vi: Chiến tranh Việt Nam

source: "There are four amendments to the Constitution about who can vote. Describe one of them."
vi: "Có bốn tu chính án về quyền bầu cử. Hãy mô tả một tu chính án."

source: "There were 13 original states. Name three."
vi: "Có 13 bang nguyên thủy. Hãy nêu tên ba bang."

source: Thirty-three (33)
vi: Ba mươi ba (33)

source: Three hundred (300)
vi: Ba trăm (300)

source: To avoid paying taxes
vi: Để tránh nộp thuế

source: To conquer the British
vi: Để chinh phục người Anh

source: To create an army
vi: Để tạo ra một đội quân

source: To declare war
vi: Để tuyên chiến

source: To issue driver licenses
vi: Để cấp giấy phép lái xe

source: To make treaties
vi: Để thực hiện các hiệp ước

source: To print money
vi: Để in tiền

source: To set up schools
vi: Để thiết lập trường học

source: Trial by jury
vi: Xét xử bởi bồi thẩm đoàn

source: Twelve (12)
vi: Mười hai (12)

source: Twenty-one (21)
vi: Hai mươi mốt (21)

source: Twenty-one (21) and older
vi: Hai mươi mốt (21) trở lên

source: Twenty-seven (27)
vi: Hai mươi bảy (27)

source: two (2)
vi: Hai (2)

source: Two (2)
vi: Hai (2)

source: Two hundred (200)
vi: Hai trăm (200)

source: U.S. diplomat
vi: Nhà ngoại giao Hoa Kỳ

source: U.S. Virgin Islands
vi: Quần đảo Virgin thuộc Hoa Kỳ

source: "Under our Constitution, some powers belong to the federal government. What is one power of the federal government?"
vi: "Theo Hiến pháp, một số quyền thuộc về chính phủ liên bang. Hãy nêu một quyền của chính phủ liên bang."

source: "Under our Constitution, some powers belong to the states. What is one power of the states?"
vi: "Theo Hiến pháp, một số quyền thuộc về các tiểu bang. Hãy nêu một quyền của tiểu bang."

source: Valentine Day
vi: Ngày lễ tình nhân

source: Veterans Day
vi: Ngày cựu chiến binh

source: Vice President
vi: Phó chủ tịch

source: vicePresident
vi: Phó chủ tịch

source: Vietnam War
vi: Chiến tranh Việt Nam

source: Vote
vi: Bỏ phiếu

source: Vote in a federal election
vi: Bỏ phiếu trong một cuộc bầu cử liên bang

source: War of 1812
vi: Chiến tranh năm 1812

source: Was a U.S. President
vi: Là một tổng thống Hoa Kỳ

source: "We elect a President for how many years?"
vi: "Chúng ta bầu một Tổng thống cho nhiệm kỳ bao nhiêu năm?"

source: "We elect a U.S. Representative for how many years?"
vi: "Chúng ta bầu một Dân biểu Hoa Kỳ cho nhiệm kỳ bao nhiêu năm?"
